Revit 2027 API
FilterStringRule.SetEvaluator Method
 Sets the evaluator that implements the test for this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEvaluator(
	FilterStringRuleEvaluator evaluator
)
Public Sub SetEvaluator (
	evaluator As FilterStringRuleEvaluator
)
public:
void SetEvaluator(
	FilterStringRuleEvaluator^ evaluator
)
member SetEvaluator :
        evaluator : FilterStringRuleEvaluator -> unit
Parameters
evaluator FilterStringRuleEvaluator
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace